In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"Name":["a", "b", "c", "d", "e", "f"],"Sex":["male", "female", "female", "male", "male", "male"]})

In [2]:
df

  Name     Sex
0    a    male
1    b  female
2    c  female
3    d    male
4    e    male
5    f    male

In [5]:
sex_mapping = {"female":1, "male":0}
df["Sex"] = df["Sex"].map(sex_mapping).astype(int)

In [6]:
df

  Name  Sex
0    a    0
1    b    1
2    c    1
3    d    0
4    e    0
5    f    0

In [3]:
df["Sex"] = df["Sex"].map({"female":1,"male":0}).astype(int)

In [4]:
df

  Name  Sex
0    a    0
1    b    1
2    c    1
3    d    0
4    e    0
5    f    0